{
    "A1": [
        { "topic": "Animals", "definition": "Multicellular, eukaryotic organisms of the kingdom Animalia (also called Metazoa)." },
        { "topic": "Food", "definition": "Any nutritious substance that people or animals eat or drink or that plants absorb in order to maintain life and growth." },
        { "topic": "Colors", "definition": "The property possessed by an object of producing different sensations on the eye as a result of the way it reflects or emits light." },
        { "topic": "Family", "definition": "A group of one or more parents and their children living together as a unit." },
        { "topic": "Weather", "definition": "The state of the atmosphere at a place and time as regards heat, dryness, sunshine, wind, rain, etc." }
    ],
    "A2": [
        { "topic": "Hobbies", "definition": "Activities done regularly in one's leisure time for pleasure." },
        { "topic": "Sports", "definition": "All forms of competitive physical activity or games which aim to use, maintain or improve physical ability and skills." },
        { "topic": "Movies", "definition": "A form of entertainment that enacts a story by sound and a sequence of images giving the illusion of continuous movement." },
        { "topic": "Music", "definition": "The art or science of combining vocal or instrumental sounds to produce beauty of form, harmony, and expression of emotion." },
        { "topic": "Travel", "definition": "The movement of people between distant geographical locations, either for leisure or for work." }
    ],
    "B1": [
        { "topic": "Education", "definition": "The process of receiving or giving systematic instruction, especially at a school or university." },
        { "topic": "Social Media", "definition": "Websites and applications that enable users to create and share content or to participate in social networking." },
        { "topic": "Fashion", "definition": "A popular trend, especially in styles of dress and ornament or manners of behavior." },
        { "topic": "Technology", "definition": "The application of scientific knowledge for practical purposes, especially in industry." },
        { "topic": "Health", "definition": "The state of being free from illness or injury." }
    ],
    "B2": [
        { "topic": "Science", "definition": "The intellectual and practical activity encompassing the systematic study of the structure and behaviour of the physical and natural world through observation and experiment." },
        { "topic": "Culture", "definition": "The arts and other manifestations of human intellectual achievement regarded collectively." },
        { "topic": "Economy", "definition": "The state of a country or region in terms of the production and consumption of goods and services and the supply of money." },
        { "topic": "Politics", "definition": "The activities associated with the governance of a country or other area." },
        { "topic": "Environment", "definition": "The surroundings or conditions in which a person, animal, or plant lives or operates." }
    ],
    "C1": [
        { "topic": "Philosophy", "definition": "The study of the fundamental nature of knowledge, reality, and existence." },
        { "topic": "Psychology", "definition": "The scientific study of the human mind and its functions, especially those affecting behavior in a given context." },
        { "topic": "Ethics", "definition": "Moral principles that govern a person's behavior or the conducting of an activity." },
        { "topic": "Art History", "definition": "The study of objects of art considered within their time period." },
        { "topic": "Astrology", "definition": "The study of the movements and relative positions of celestial bodies interpreted as having an influence on human affairs." }
    ],
    "C2": [
        { "topic": "Innovation", "definition": "The action or process of innovating; a new method, idea, product, etc." },
        { "topic": "Globalization", "definition": "The process by which businesses or other organizations develop international influence or start operating on an international scale." },
        { "topic": "Sustainability", "definition": "The ability to be maintained at a certain rate or level; avoidance of the depletion of natural resources." },
        { "topic": "Artificial Intelligence", "definition": "The simulation of human intelligence processes by machines, especially computer systems." },
        { "topic": "Quantum Physics", "definition": "The branch of physics that deals with the mathematical description of the dual particle-like and wave-like behavior and interactions of energy and matter." }
    ]
}
